* IN PROGRESS push_swap
DEADLINE: <2024-03-15 Fri>
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:END:
** CODING program
:PROPERTIES:
:Effort:   70:00
:END:
:LOGBOOK:
CLOCK: [2024-03-12 Tue 12:30]--[2024-03-12 Tue 15:20] =>  2:50
CLOCK: [2024-03-11 Mon 15:12]--[2024-03-11 Mon 16:14] =>  1:02
CLOCK: [2024-03-11 Mon 12:30]--[2024-03-11 Mon 13:22] =>  0:52
CLOCK: [2024-03-11 Mon 09:38]--[2024-03-11 Mon 12:06] =>  2:28
CLOCK: [2024-03-08 Fri 17:49]--[2024-03-08 Fri 19:53] =>  2:04
CLOCK: [2024-03-05 Tue 11:18]--[2024-03-05 Tue 11:51] =>  0:33
CLOCK: [2024-03-05 Tue 10:58]--[2024-03-05 Tue 11:15] =>  0:17
CLOCK: [2024-03-05 Tue 09:52]--[2024-03-05 Tue 10:48] =>  0:56
CLOCK: [2024-03-05 Tue 09:14]--[2024-03-05 Tue 09:52] =>  0:38
CLOCK: [2024-02-29 Thu 14:47]--[2024-02-29 Thu 16:16] =>  1:29
CLOCK: [2024-02-29 Thu 11:54]--[2024-02-29 Thu 12:55] =>  1:01
CLOCK: [2024-02-29 Thu 09:32]--[2024-02-29 Thu 10:35] =>  1:03
CLOCK: [2024-02-29 Thu 09:06]--[2024-02-29 Thu 09:08] =>  0:02
CLOCK: [2024-02-28 Wed 15:15]--[2024-02-28 Wed 15:56] =>  0:41
CLOCK: [2024-02-28 Wed 14:36]--[2024-02-28 Wed 15:02] =>  0:26
CLOCK: [2024-02-28 Wed 14:00]--[2024-02-28 Wed 14:34] =>  0:34
CLOCK: [2024-02-28 Wed 10:55]--[2024-02-28 Wed 11:01] =>  0:06
CLOCK: [2024-02-27 Tue 12:01]--[2024-02-27 Tue 14:42] =>  2:41
CLOCK: [2024-02-26 Mon 18:37]--[2024-02-26 Mon 19:19] =>  0:42
CLOCK: [2024-02-26 Mon 16:30]--[2024-02-26 Mon 18:24] =>  1:54
CLOCK: [2024-02-26 Mon 12:56]--[2024-02-26 Mon 13:17] =>  0:21
CLOCK: [2024-02-26 Mon 12:00]--[2024-02-26 Mon 12:55] =>  0:55
:END:
*** NOTES
possible cases:
- few numbers in stack : 3 - ?
- already sorted stack -> nothing
- descending nb sorted stack -> only rotatations, no swaps
- suffled stack
Ideas:
- "cutting" at pivot & sorting stacks separately
- naive approach: pushing numbers in ascending order to b then pushing all to a
- "bubble-sort-like": push if 0 < 1 else swap then sort b
- Sorting numbers by range of 3 => sorting in the smallest stack

Optimization: keep track of all commands & optimize at the end
** CODING bonus
:LOGBOOK:
CLOCK: [2024-03-08 Fri 12:20]--[2024-03-08 Fri 14:59] =>  2:39
CLOCK: [2024-03-07 Thu 14:48]--[2024-03-07 Thu 16:03] =>  1:15
CLOCK: [2024-03-07 Thu 13:40]--[2024-03-07 Thu 14:35] =>  0:55
CLOCK: [2024-03-07 Thu 13:13]--[2024-03-07 Thu 13:40] =>  0:27
CLOCK: [2024-03-07 Thu 12:38]--[2024-03-07 Thu 13:06] =>  0:28
:END:

** IN PROGRESS think/test/etc
:LOGBOOK:
CLOCK: [2024-03-12 Tue 12:15]--[2024-03-12 Tue 12:30] =>  0:15
CLOCK: [2024-03-07 Thu 12:20]--[2024-03-07 Thu 12:38] =>  0:18
CLOCK: [2024-03-07 Thu 12:00]--[2024-03-07 Thu 12:18] =>  0:18
CLOCK: [2024-03-05 Tue 19:55]--[2024-03-05 Tue 20:29] =>  0:34
CLOCK: [2024-03-05 Tue 19:49]--[2024-03-05 Tue 19:54] =>  0:05
CLOCK: [2024-03-05 Tue 14:42]--[2024-03-05 Tue 15:17] =>  0:35
CLOCK: [2024-03-05 Tue 12:03]--[2024-03-05 Tue 12:56] =>  0:53
:END:
